{"chatbot":
  [
	{"tag": "greeting",
	"patterns": ["Hi", "Hey", "How are you", "Hola", "Hello"],
	"responses": ["Hello", "Good to see you", "Hi there, how can i help you ? "]
	},
	{"tag": "good",
	"patterns": ["Bye", "See you later", "Goodbye", "Till next time"],
	"responses": ["See you !", "Have a nice day", "Bye", "Come back jack"]
	},
	{"tag": "chatbot_def",
	"patterns": ["What is a chatbot?", "Definition for chatboot"],
	"responses" : ["A chatbot is a software application used to conduct an on-line chat conversation via text or text-to-speech, in lieu of providing direct contact with a live human agent. "]
	},
	{"tag": "Feelings",
	"patterns": ["I feel bad, can you show me a dog or a cat?"],
	"responses" : ["photo with cat", "photo with dog"]
	},
	{"tag": "games",
	"patterns": ["What games are on this platform?","Can you tell me what interesting games are on this platform?"],
	"responses" : ["Red Dead Redemption, League of Legends, The Witcher 3, Dark Souls 3, Counter-Strike: Global Offensive, Apex Legends, Mafia III, Eve. Choose a game!"]
	},
	{"tag": "League of Legends",
	"patterns": ["League of Legends"],
	"responses" : ["In the game, two teams of five players battle in player versus player combat, with each team occupying and defending their own separate base on the map. Each of the ten players controls a character, known as a champion, with unique abilities and differing styles of play. During a match, champions collect experience points to level up and purchase items in order to defeat the opposing team. In the game's main mode, Summoner's Rift, a team wins by being the first to destroy the other team's Nexus, a large structure located within their base."]
	},
	{"tag": "Counter-Strike: Global Offensive",
	"patterns": ["Counter-Strike: Global Offensive"],
	"responses" : ["The game pits two teams against each other: the Terrorists and the Counter-Terrorists. Both sides are tasked with eliminating the other while also completing separate objectives. The Terrorists, depending on the game mode, must either plant the bomb or defend the hostages, while the Counter-Terrorists must either prevent the bomb from being planted, defuse the bomb, or rescue the hostages. There are nine game modes, all of which have distinct characteristics specific to that mode. The game also has matchmaking support that allows players to play on dedicated Valve servers, as well as allowing members of the community to host their own servers with custom maps and game modes. A battle-royale game-mode, Danger Zone, was introduced in December 2018."]
	},
	{"tag": "Apex Legends",
	"patterns": ["Apex Legends"],
	"responses" : ["In Apex Legends, up to 20 three-person squads or 30 two-person duos land on an island and search for weapons and supplies before attempting to defeat all other players in combat. The available play area on the island shrinks over time, forcing players to keep moving or else find themselves outside the play area which can be fatal. The final team alive wins the round. The game is set in the same science fiction universe as Respawn Entertainment's Titanfall and Titanfall 2.[3]"]},
	{"tag": "Red Dead Redemption",
	"patterns": ["Red Dead Redemption"],
	"responses" : ["The game pits two teams against each other: the Terrorists and the Counter-Terrorists. Both sides are tasked with eliminating the other while also completing separate objectives. The Terrorists, depending on the game mode, must either plant the bomb or defend the hostages, while the Counter-Terrorists must either prevent the bomb from being planted, defuse the bomb, or rescue the hostages. There are nine game modes, all of which have distinct characteristics specific to that mode. The game also has matchmaking support that allows players to play on dedicated Valve servers, as well as allowing members of the community to host their own servers with custom maps and game modes. A battle-royale game-mode, Danger Zone, was introduced in December 2018."]
	},
	{"tag": "Dark Souls 3",
	"patterns": ["Dark Souls 3"],
	"responses" : ["Set in the Kingdom of Lothric, a bell has rung to signal that the First Flame, responsible for maintaining the Age of Fire, is dying out. As has happened many times before, the coming of the Age of Dark produces the undead: cursed beings that rise up after death. The Age of Fire can be prolonged with the linking of the fire, a ritual in which great lords and heroes sacrifice their souls to rekindle the First Flame. However, Prince Lothric, the chosen linker for this age, has abandoned his duty and instead chooses to watch the flame die from afar. The bell is the last hope for the Age of Fire, resurrecting previous Lords of Cinder (heroes who linked the flame in past ages) to attempt to link the fire again; however, all but one Lord shirk their duty. Meanwhile, a sorcerer from the painted world, Sulyvahn, wrongfully proclaims himself Pontiff and rules over Irithyll of the Boreal Valley and the returning cathedral from Dark Souls, Anor Londo as a tyrant.The Ashen One, an Undead who failed to become a Lord of Cinder and thus called an Unkindled, rises and must link the fire by returning Prince Lothric and the defiant Lords of Cinder to their thrones in Firelink Shrine. The Lords include the Abyss Watchers, a legion of warriors, sworn by the Old Wolf's Blood which linked their souls into one, to protect the land from the Abyss, and were ultimately locked in an endless battle between each other; Yhorm the Giant, who was once a conqueror of the very people for whom he then sacrificed his life; and Aldrich, who became a Lord of Cinder despite his ravenous appetite for both men and gods. Lothric himself was raised in order to link the First Flame, but rejected his destiny and chose to watch the fire fade.Once the Ashen One succeeds in returning Lothric and the Lords of Cinder to their thrones, they travel to the ruins of the Kiln of the First Flame. There, they encounter the Soul of Cinder, an amalgamation of all the previous Lords of Cinder who had linked the flame in the past. Once the Soul of Cinder is defeated, four endings are made possible based on the player's actions during the game. The player can attempt to link the fire, summon the Fire Keeper to extinguish the flame and begin an age of Dark, or kill her. A fourth ending consists of the Ashen One taking the flame for their own and becoming the Dark Lord of Londor."]},
	{"tag": "Mafia III",
	"patterns": ["Mafia III"],
	"responses" : ["Mafia III is an action-adventure game set in an open world environment and played from a third-person perspective, in which the player assume control of Lincoln Clay, a Vietnam War veteran on a quest to seek revenge for his adopted family, who are murdered by local mobs. The game is set in 1968 New Bordeaux, a re-imagined version of New Orleans, with the game world being larger than the Mafia and Mafia II maps combined. Mafia III's map is made up of ten districts: Bayou Fantom, Delray Hollow, Barclay Mills, Frisco Fields, Pointe Verdun, Tickfaw Harbor, Southdowns, River Row, Downtown, and the French Ward. Players can complete objectives using a variety of approaches. For example, players can use the weapons provided in the game, like shotguns and revolvers, to eliminate enemies, or call for allies, who arrive in a van and assist players. Alternatively, they can make use of stealth tactics throughout the entire mission without being noticed by enemies. The core gameplay revolves around gunplay. In addition, players can also perform executing moves and engage in melee-combat. The game features a cover system, allowing players to take cover behind objects to avoid enemy gunfire or detection.[3] Players can interrogate non-playable characters after defeating them in order to gain more information on their objectives, like scaring them while driving a car.[4] Players can attack and overrun locations owned by the Italian mob, and assign one of their lieutenants to operate around the local area.[5] The game allows players to drive cars from the era with realistic driving mechanics and sounds.[6]"]},
	{"tag": "Eve",
	"patterns": ["Eve"],
	"responses" : ["Set more than 21,000 years in the future, the background story of Eve Online explains that humanity, having used up most of Earth's resources through centuries of explosive population growth, began colonizing the rest of the Milky Way.[13][14] As on Earth, this expansion also led to competition and fighting over available resources, but everything changed with the discovery of a natural wormhole leading to an unexplored galaxy subsequently dubbed \"New Eden.\" Dozens of colonies were founded, and a structure, a gate of sorts (which bears the inscription \"EVE\" on the New Eden side), was built to stabilize the wormhole that linked the colonies of New Eden with the rest of human civilization. However, when the wormhole unexpectedly collapsed, it destroyed the gate as well as the connection between the colonies of New Eden and the Milky Way. Cut off from the rest of humanity and supplies from Earth, the colonies of New Eden were left starving and disconnected from one another; many died out entirely. Over the millennia the descendants of the surviving colonists managed to rebuild their own societies, but by this time the memories and knowledge of humanity's origins, of Earth and the Milky Way galaxy, as well as the history of the settling of New Eden, were lost; what little information that survived transmission over the generations was misunderstood, lost in translation, or consigned to mythology. Five major distinct societies rose to prominence from the surviving colonies, all growing into interstellar spaceflight-capable civilizations. The states based around these societies make up the five major factions in Eve Online: the Amarr Empire, the Caldari State, the Gallente Federation, the Minmatar Republic, and the Jove Directorate."]
	},
	{"tag": "The Witcher 3",
	"patterns": ["The Witcher 3"],
	"responses" : ["The Witcher 3: Wild Hunt is an action role-playing game with a third-person perspective. Players control Geralt of Rivia, a monster slayer known as a Witcher.[4] Geralt walks, runs, rolls and dodges, and (for the first time in the series) jumps, climbs and swims.[5][6] He has a variety of weapons, including bombs, a crossbow and two swords (one steel and one silver).[7] The steel sword is used primarily to kill humans while the silver sword is more effective against creatures and monsters.[8] Players can draw out, switch and sheathe their swords at will. There are two modes of melee attack; light attacks are fast but weak, and heavy attacks are slow but strong.[9] Players can block and counter enemy attacks with their swords.[7] Swords have limited endurance and require regular repair.[10] In addition to physical attacks, Geralt has five magical signs at his disposal: Aard, Axii, Igni, Yrden and Quen.[11] Aard prompts Geralt to unleash a telekinetic blast, Axii confuses enemies, Igni burns them, Yrden slows them down and Quen offers players a temporary, protective shield.[12] The signs use stamina, and cannot be used indefinitely.[13] Players can use mutagens to increase Geralt's magic power. Geralt loses health when attacked by enemies, although wearing armour can help reduce health loss. Health is restored with meditation or consumables, such as food and potions.[7] Players occasionally control Ciri, Geralt's adoptive daughter who can teleport short distances."]},
	{"tag": "noanswer",
	"patterns": [],
	"responses" : ["Sorry, can't understand you. Do you want to search on wikipedia? Yes/No"]
	}
  ]
}
